MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_pwc.c
 **
 ** A detailed description is available at
 ** @link PwcGroup PWC description @endlink
 **
 **   - 2018-10-28  1.0  Chengy First version for Device Driver Library of PWC.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_pwc.h"
#include "hc32f46x_utility.h"

#if (DDL_PWC_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup PwcGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define ENABLE_FCG0_REG_WRITE() (M4_MSTP->FCG0PC |= 0xa5a50001u)
#define DISABLE_FCG0_REG_WRITE() (M4_MSTP->FCG0PC = 0xa5a50000u)

#define ENABLE_PWR_REG0_WRITE() (M4_SYSREG->PWR_FPRC |= 0xa503u)
#define DISABLE_PWR_REG0_WRITE() (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~3u))))

#define ENABLE_PWR_REG_WRITE() (M4_SYSREG->PWR_FPRC |= 0xa502u)
#define DISABLE_PWR_REG_WRITE() (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~2u))))

#define ENABLE_PVD_REG_WRITE() (M4_SYSREG->PWR_FPRC |= 0xa508u)
#define DISABLE_PVD_REG_WRITE() (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~8u))))

/*! Parameter validity check for wake up event. */
#define IS_PWC_WKUP_EVENT(evt) ((0x00u) != (evt))

/*! Parameter validity check for wake up event. */
#define IS_PWC_WKUP2_EVENT(evt) ((0x08u) != (evt))

/*! Parameter validity check for wake up flag. */
#define IS_PWC_WKUP0_FLAG(flag) ((0x80u) != (flag))

/*! Parameter validity check for wake up flag. */
#define IS_PWC_WKUP1_FLAG(flag) ((0x07u) != (flag))

/*! Parameter validity check for power down mode. */
#define IS_PWC_PWR_DOWN_MODE(md) \
    (((md) == PowerDownMd1) ||   \
     ((md) == PowerDownMd2) ||   \
     ((md) == PowerDownMd3) ||   \
     ((md) == PowerDownMd4))

/*! Parameter validity check for power down wake_up time control. */
#define IS_PWC_PWR_DOWN_WKUP_TIM(x) \
    (((x) == Vcap01) ||             \
     ((x) == Vcap0047))

/*! Parameter validity check for IO retain state while power down. */
#define IS_PWC_PWR_DWON_IO_STATE(x) \
    (((x) == IoPwrDownRetain) ||    \
     ((x) == IoPwrRstRetain) ||     \
     ((x) == IoHighImp))

/*! Parameter validity check for driver ability while enter stop mode. */
#define IS_PWC_STP_DRIVER_ABILITY(x) \
    (((x) == StopHighspeed) ||       \
     ((x) == StopUlowspeed))

/*! Parameter validity check for driver ability. */
#define IS_PWC_DRIVER_ABILITY(x) \
    (((x) == Ulowspeed) ||       \
     ((x) == HighSpeed))

/*! Parameter validity check for dynamic voltage. */
#define IS_PWC_DYNAMIC_VOLTAGE(val) \
    (((val) == Voltage09) ||        \
     ((val) == Voltage11))

/*! Parameter validity check for wake_up edge. */
#define IS_PWC_WKUP_EDGE(edg)  \
    (((edg) == EdgeFalling) || \
     ((edg) == EdgeRising))

#define IS_PWC_PVDWKUP_EDGE(edg) \
    (((edg) == OverVcc) ||       \
     ((edg) == BelowVcc))

/*! Parameter validity check for peripheral in fcg0. */
#define IS_PWC_FCG0_PERIPH(per)              \
    ((((per) & (0x700C3AEEu)) == (0X00u)) && \
     ((0x00u) != (per)))

/*! Parameter validity check for peripheral in fcg1. */
#define IS_PWC_FCG1_PERIPH(per)              \
    ((((per) & (0xF0F00286u)) == (0X00u)) && \
     ((0x00u) != (per)))

/*! Parameter validity check for peripheral in fcg2. */
#define IS_PWC_FCG2_PERIPH(per)              \
    ((((per) & (0xFFF87800u)) == (0X00u)) && \
     ((0x00u) != (per)))

/*! Parameter validity check for peripheral in fcg3. */
#define IS_PWC_FCG3_PERIPH(per)              \
    ((((per) & (0XFFFFEEECu)) == (0X00u)) && \
     ((0x00u) != (per)))

/*! Parameter validity check for clock value while stop mode mode. */
#define IS_PWC_STOP_MODE_CLK(clk) \
    (((clk) == ClkFix) ||         \
     ((clk) == ClkMrc))

/*! Parameter validity check for flash mode while stop mode mode. */
#define IS_PWC_STOP_MODE_FLASH(x) \
    (((x) == Wait) ||             \
     ((x) == NotWait))

/*! Parameter validity check for wake_up timer over flag. */
#define IS_PWC_WKTMOVER_FLAG(flag) \
    (((flag) == UnEqual) ||        \
     ((flag) == Equal))

