MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
/*! Parameter validity check for ram power control. */
#define IS_PWC_RAM_PWR_CTL(x) \
    (((x) == DynamicCtl) ||   \
     ((x) == PowDownCtl))

/*! Parameter validity check for ram operate mode. */
#define IS_PWC_RAM_OP_MD(x)  \
    (((x) == HighSpeedMd) || \
     ((x) == UlowSpeedMd))

/*! Parameter validity check for wake_up timer clock. */
#define IS_PWC_WKTM_CLK(clk) \
    (((clk) == Wk64hz) ||    \
     ((clk) == WkXtal32) ||  \
     ((clk) == WkLrc))

/*! Parameter validity check for handle of pvd. */
#define IS_PWC_PVD_MD(x) \
    (((x) == PvdInt) ||  \
     ((x) == PvdReset))

/*! Parameter validity check for pvd1 level. */
#define IS_PWC_PVD_FILTER_CLK(clk) \
    (((clk) == PvdLrc025) ||       \
     ((clk) == PvdLrc05) ||        \
     ((clk) == PvdLrc1) ||         \
     ((clk) == PvdLrc2))

/*! Parameter validity check for pvd2 level. */
#define IS_PWC_PVD2_LEVEL(lvl) \
    (((lvl) == Pvd2Level21) || \
     ((lvl) == Pvd2Level23) || \
     ((lvl) == Pvd2Level25) || \
     ((lvl) == Pvd2Level26) || \
     ((lvl) == Pvd2Level27) || \
     ((lvl) == Pvd2Level28) || \
     ((lvl) == Pvd2Level29) || \
     ((lvl) == Pvd2Level11))

/*! Parameter validity check for pvd1 level. */
#define IS_PWC_PVD1_LEVEL(lvl) \
    (((lvl) == Pvd1Level20) || \
     ((lvl) == Pvd1Level21) || \
     ((lvl) == Pvd1Level23) || \
     ((lvl) == Pvd1Level25) || \
     ((lvl) == Pvd1Level26) || \
     ((lvl) == Pvd1Level27) || \
     ((lvl) == Pvd1Level28) || \
     ((lvl) == Pvd1Level29))

/*! Parameter validity check for pvd interrupt. */
#define IS_PWC_PVD_INT_SEL(x) \
    (((x) == NonMskInt) ||    \
     ((x) == MskInt))

/*! Parameter validity check for valid wakeup source from stop mode. */
#define IS_VALID_WKUP_SRC(x)     \
    (((x) == INT_USART1_WUPI) || \
     ((x) == INT_TMR01_GCMA) ||  \
     ((x) == INT_RTC_ALM) ||     \
     ((x) == INT_RTC_PRD) ||     \
     ((x) == INT_WKTM_PRD) ||    \
     ((x) == INT_ACMP1) ||       \
     ((x) == INT_PVD_PVD1) ||    \
     ((x) == INT_PVD_PVD2) ||    \
     ((x) == INT_SWDT_REFUDF) || \
     ((x) == INT_PORT_EIRQ0) ||  \
     ((x) == INT_PORT_EIRQ1) ||  \
     ((x) == INT_PORT_EIRQ2) ||  \
     ((x) == INT_PORT_EIRQ3) ||  \
     ((x) == INT_PORT_EIRQ4) ||  \
     ((x) == INT_PORT_EIRQ5) ||  \
     ((x) == INT_PORT_EIRQ6) ||  \
     ((x) == INT_PORT_EIRQ7) ||  \
     ((x) == INT_PORT_EIRQ8) ||  \
     ((x) == INT_PORT_EIRQ9) ||  \
     ((x) == INT_PORT_EIRQ10) || \
     ((x) == INT_PORT_EIRQ11) || \
     ((x) == INT_PORT_EIRQ12) || \
     ((x) == INT_PORT_EIRQ13) || \
     ((x) == INT_PORT_EIRQ14) || \
     ((x) == INT_PORT_EIRQ15))

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
uint32_t NVIC_ISER_BAK[5];
uint8_t u8HrcState = 0u;
uint8_t u8MrcState = 0u;
uint8_t u8WkupIntCnt = 0u;
uint8_t u8StopFlag = 0u;
uint8_t u8SysClkSrc = 1u;

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  The power mode configuration.
 **
 ** \param  [in] pstcPwrMdCfg           The power mode configuration.
 ** \arg    enPwrDownMd                 The power down mode.
 ** \arg    enRLdo                      Enable or disable RLDO.
 ** \arg    enRetSram                   Enable or disable RetSram.
 ** \arg    enVPll                      Enable or disable PLL VCC.
 ** \arg    enVHrc                      Enable or disable Hrc VCC.
 ** \arg    enIoRetain                  The IO state while power down.
 ** \arg    enDynVol                    The dynamic voltage.
 ** \arg    enPwrDWkupTm                The wake_up timer while power down.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PowerModeCfg(const stc_pwc_pwr_mode_cfg_t *pstcPwrMdCfg)
{
    DDL_ASSERT(IS_PWC_PWR_DOWN_MODE(pstcPwrMdCfg->enPwrDownMd));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPwrMdCfg->enRLdo));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPwrMdCfg->enRetSram));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPwrMdCfg->enVPll));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPwrMdCfg->enVHrc));
    DDL_ASSERT(IS_PWC_PWR_DWON_IO_STATE(pstcPwrMdCfg->enIoRetain));
    DDL_ASSERT(IS_PWC_DRIVER_ABILITY(pstcPwrMdCfg->enDrvAbility));
    DDL_ASSERT(IS_PWC_DYNAMIC_VOLTAGE(pstcPwrMdCfg->enDynVol));
    DDL_ASSERT(IS_PWC_PWR_DOWN_WKUP_TIM(pstcPwrMdCfg->enPwrDWkupTm));

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_PWRC0 = (pstcPwrMdCfg->enPwrDownMd |
                            (uint8_t)(((Enable == pstcPwrMdCfg->enRLdo) ? 0u : 1u) << 2u) |
                            (uint8_t)(((Enable == pstcPwrMdCfg->enRetSram) ? 0u : 1u) << 3u) |
                            (pstcPwrMdCfg->enIoRetain << 4u));

    M4_SYSREG->PWR_PWRC1_f.VHRCSD = ((Enable == pstcPwrMdCfg->enVHrc) ? 0u : 1u);
    M4_SYSREG->PWR_PWRC1_f.VPLLSD = ((Enable == pstcPwrMdCfg->enVPll) ? 0u : 1u);

    M4_SYSREG->PWR_PWRC2 = (pstcPwrMdCfg->enDrvAbility |
                            (pstcPwrMdCfg->enDynVol << 4u));

    M4_SYSREG->PWR_PWRC3_f.PDTS = pstcPwrMdCfg->enPwrDWkupTm;

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enter power down mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
#if defined(__ICCARM__)
__ramfunc
#endif
    void
    PWC_EnterPowerDownMd(void)
{
    ENABLE_PVD_REG_WRITE();

    /* Reset PVD1IRS & PVD2IRS */
    M4_SYSREG->PWR_PVDCR1 &= 0xddu;

    DISABLE_PVD_REG_WRITE();

    ENABLE_PWR_REG_WRITE();

