MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
    M4_SYSREG->PWR_STPMCR_f.STOP = 1u;

    __disable_irq();
    M4_SYSREG->PWR_PWRC0_f.PWDN = 1u;
    for (uint8_t i = 0u; i < 10u; i++)
    {
        __NOP();
    }
    __enable_irq();

    DISABLE_PWR_REG_WRITE();

    __WFI();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the power down wake up event.
 **
 ** \param  [in] u32Wkup0Event          The wake_up event in PDWKEN0.
 ** \arg    PWC_PDWKEN0_WKUP00          Wake_up 0_0 event
 ** \arg    PWC_PDWKEN0_WKUP01          Wake_up 0_1 event
 ** \arg    PWC_PDWKEN0_WKUP02          Wake_up 0_2 event
 ** \arg    PWC_PDWKEN0_WKUP03          Wake_up 0_3 event
 ** \arg    PWC_PDWKEN0_WKUP10          Wake_up 1_0 event
 ** \arg    PWC_PDWKEN0_WKUP11          Wake_up 1_1 event
 ** \arg    PWC_PDWKEN0_WKUP12          Wake_up 1_2 event
 ** \arg    PWC_PDWKEN0_WKUP13          Wake_up 1_3 event
 **
 ** \param  [in] enNewState             The new state of the wake_up event.
 ** \arg    Enable                      Enable wake_up event.
 ** \arg    Disable                     Disable wake_up event.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PdWakeup0Cmd(uint32_t u32Wkup0Event, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_WKUP_EVENT(u32Wkup0Event));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PWR_REG_WRITE();

    if (Enable == enNewState)
    {
        M4_SYSREG->PWR_PDWKE0 |= (uint8_t)u32Wkup0Event;
    }
    else
    {
        M4_SYSREG->PWR_PDWKE0 &= (uint8_t)(~u32Wkup0Event);
    }

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the power down wake up event.
 **
 ** \param  [in] u32Wkup1Event          The wake_up event in PDWKEN0.
 ** \arg    PWC_PDWKEN1_WKUP20          Wake_up 2_0 event
 ** \arg    PWC_PDWKEN1_WKUP21          Wake_up 2_1 event
 ** \arg    PWC_PDWKEN1_WKUP22          Wake_up 2_2 event
 ** \arg    PWC_PDWKEN1_WKUP23          Wake_up 2_3 event
 ** \arg    PWC_PDWKEN1_WKUP30          Wake_up 3_0 event
 ** \arg    PWC_PDWKEN1_WKUP31          Wake_up 3_1 event
 ** \arg    PWC_PDWKEN1_WKUP32          Wake_up 3_2 event
 ** \arg    PWC_PDWKEN1_WKUP33          Wake_up 3_3 event
 **
 ** \param  [in] enNewState             The new state of the wake_up event.
 ** \arg    Enable                      Enable wake_up event.
 ** \arg    Disable                     Disable wake_up event.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PdWakeup1Cmd(uint32_t u32Wkup1Event, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_WKUP_EVENT(u32Wkup1Event));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PWR_REG_WRITE();

    if (Enable == enNewState)
    {
        M4_SYSREG->PWR_PDWKE1 |= (uint8_t)u32Wkup1Event;
    }
    else
    {
        M4_SYSREG->PWR_PDWKE1 &= (uint8_t)(~u32Wkup1Event);
    }

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the power down wake up event.
 **
 ** \param  [in] u32Wkup2Event           The wake_up event in PDWKEN0.
 ** \arg    PWC_PDWKEN2_PVD1            Wake_up PVD1 event
 ** \arg    PWC_PDWKEN2_PVD2            Wake_up PVD2 event
 ** \arg    PWC_PDWKEN2_NMI             Wake_up NMI event
 ** \arg    PWC_PDWKEN2_RTCPRD          Wake_up RTCPRD event
 ** \arg    PWC_PDWKEN2_RTCAL           Wake_up RTCAL event
 ** \arg    PWC_PDWKEN2_XTAL32          Wake_up XTAL32 event
 ** \arg    PWC_PDWKEN2_WKTM            Wake_up WKTM event
 **
 ** \param  [in] enNewState             The new state of the wake_up event.
 ** \arg    Enable                      Enable wake_up event.
 ** \arg    Disable                     Disable wake_up event.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PdWakeup2Cmd(uint32_t u32Wkup2Event, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_WKUP2_EVENT(u32Wkup2Event));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PWR_REG_WRITE();

    if (Enable == enNewState)
    {
        M4_SYSREG->PWR_PDWKE2 |= (uint8_t)u32Wkup2Event;
    }
    else
    {
        M4_SYSREG->PWR_PDWKE2 &= (uint8_t)(~u32Wkup2Event);
    }

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  The power down wake up event edge configuration.
 **
 ** \param  [in] pstcWkupEdgeCfg        The wake_up event edge configuration.
 ** \arg    enPtwk0Edge                 Ptwk0 edge
 ** \arg    enPtwk1Edge                 Ptwk1 edge
 ** \arg    enPtwk2Edge                 Ptwk2 edge
 ** \arg    enPtwk3Edge                 Ptwk3 edge
 ** \arg    enPvd1Edge                  Pvd1 edge
 ** \arg    enPvd1Edge                  Pvd2 edge
 ** \arg    enNmiEdge                   Nmi edge
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PdWkupEdgeCfg(const stc_pwc_wkup_edge_cfg_t *pstcWkupEdgeCfg)
{
    DDL_ASSERT(IS_PWC_WKUP_EDGE(pstcWkupEdgeCfg->enPtwk0Edge));
    DDL_ASSERT(IS_PWC_WKUP_EDGE(pstcWkupEdgeCfg->enPtwk1Edge));
    DDL_ASSERT(IS_PWC_WKUP_EDGE(pstcWkupEdgeCfg->enPtwk2Edge));
    DDL_ASSERT(IS_PWC_WKUP_EDGE(pstcWkupEdgeCfg->enPtwk3Edge));
    DDL_ASSERT(IS_PWC_WKUP_EDGE(pstcWkupEdgeCfg->enNmiEdge));
    DDL_ASSERT(IS_PWC_PVDWKUP_EDGE(pstcWkupEdgeCfg->enPvd1Edge));
    DDL_ASSERT(IS_PWC_PVDWKUP_EDGE(pstcWkupEdgeCfg->enPvd1Edge));

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_PDWKES = (pstcWkupEdgeCfg->enPtwk0Edge |
                             (pstcWkupEdgeCfg->enPtwk1Edge << 1) |
                             (pstcWkupEdgeCfg->enPtwk2Edge << 2) |
                             (pstcWkupEdgeCfg->enPtwk3Edge << 3) |
                             (pstcWkupEdgeCfg->enPvd1Edge << 4) |
                             (pstcWkupEdgeCfg->enPvd1Edge << 5) |
                             (pstcWkupEdgeCfg->enNmiEdge << 6));

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Get wake_up event in PDWKF0 flag.
 **
 ** \param  [in] u8WkupFlag             The wake_up event in PDWKF0.
 ** \arg    PWC_PTWK0_WKUPFLAG          Ptwk0 wake_up flag
 ** \arg    PWC_PTWK1_WKUPFLAG          Ptwk1 wake_up flag
 ** \arg    PWC_PTWK2_WKUPFLAG          Ptwk2 wake_up flag
 ** \arg    PWC_PTWK3_WKUPFLAG          Ptwk3 wake_up flag
 ** \arg    PWC_PVD1_WKUPFLAG           Pvd1 wake_up flag
 ** \arg    PWC_PVD2_WKUPFLAG           Pvd2 wake_up flag
 ** \arg    PWC_NMI_WKUPFLAG            Nmi wake_up flag
 **
 ** \retval en_flag_status_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t PWC_GetWakeup0Flag(uint8_t u8WkupFlag)
{
    uint8_t u8flag;
    DDL_ASSERT(IS_PWC_WKUP0_FLAG(u8WkupFlag));

