MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
    u8flag = (M4_SYSREG->PWR_PDWKF0 & u8WkupFlag);

    return ((0u == u8flag) ? Reset : Set);
}

/**
 *******************************************************************************
 ** \brief  Get wake_up event in PDWKF1 flag.
 **
 ** \param  [in] u8WkupFlag             The wake_up event in PDWKF1.
 ** \arg    PWC_RXD0_WKUPFLAG           Rxd0 wake_up flag
 ** \arg    PWC_RTCPRD_WKUPFALG         Rtcprd wake_up flag
 ** \arg    PWC_RTCAL_WKUPFLAG          Rtcal wake_up flag
 ** \arg    PWC_XTAL32ER_WKUPFALG       Xtal32er wake_up flag
 ** \arg    PWC_WKTM_WKUPFLAG           Wktm wake_up flag
 **
 ** \retval en_flag_status_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t PWC_GetWakeup1Flag(uint8_t u8WkupFlag)
{
    uint8_t u8flag;
    DDL_ASSERT(IS_PWC_WKUP1_FLAG(u8WkupFlag));

    u8flag = (M4_SYSREG->PWR_PDWKF1 & u8WkupFlag);

    return ((0u == u8flag) ? Reset : Set);
}

/**
 *******************************************************************************
 ** \brief  clear wake_up event in PDWKF0 flag.
 **
 ** \param  [in] u8WkupFlag             The wake_up event in PDWKF0.
 ** \arg    PWC_PTWK0_WKUPFLAG          Ptwk0 wake_up flag
 ** \arg    PWC_PTWK1_WKUPFLAG          Ptwk1 wake_up flag
 ** \arg    PWC_PTWK2_WKUPFLAG          Ptwk2 wake_up flag
 ** \arg    PWC_PTWK3_WKUPFLAG          Ptwk3 wake_up flag
 ** \arg    PWC_PVD1_WKUPFLAG           Pvd1 wake_up flag
 ** \arg    PWC_PVD2_WKUPFLAG           Pvd2 wake_up flag
 ** \arg    PWC_NMI_WKUPFLAG            Nmi wake_up flag
 **
 ** \retval en_flag_status_t
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_ClearWakeup0Flag(uint8_t u8WkupFlag)
{
    DDL_ASSERT(IS_PWC_WKUP0_FLAG(u8WkupFlag));

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_PDWKF0 &= (uint8_t)(~u8WkupFlag);

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  clear wake_up event in PDWKF1 flag.
 **
 ** \param  [in] u8WkupFlag             The wake_up event in PDWKF1.
 ** \arg    PWC_RXD0_WKUPFLAG           Rxd0 wake_up flag
 ** \arg    PWC_RTCPRD_WKUPFALG         Rtcprd wake_up flag
 ** \arg    PWC_RTCAL_WKUPFLAG          Rtcal wake_up flag
 ** \arg    PWC_XTAL32ER_WKUPFALG       Xtal32er wake_up flag
 ** \arg    PWC_WKTM_WKUPFLAG           Wktm wake_up flag
 **
 ** \retval en_flag_status_t
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_ClearWakeup1Flag(uint8_t u8WkupFlag)
{
    DDL_ASSERT(IS_PWC_WKUP1_FLAG(u8WkupFlag));

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_PDWKF1 &= (uint8_t)(~u8WkupFlag);

    DISABLE_PWR_REG_WRITE();
}
/**
 *******************************************************************************
 ** \brief  Enable or disable power monitor .
 **
 ** \param  [in] enNewState             The power monitor state.
 ** \arg    Enable                      Enable power monitor.
 ** \arg    Disable                     Disable power monitor.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PwrMonitorCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_PWCMR_f.ADBUFE = ((Enable == enNewState) ? 1u : 0u);

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the FCG0 peripheral clock.
 **
 ** \note   After reset,the peripheral clock is disabled and the application
 **         software has to enable this clock before using it.
 **
 ** \param  [in] u32Fcg0Periph          The peripheral in FCG0.
 ** \arg    PWC_FCG0_PERIPH_RAMHS       RAMHS clock
 ** \arg    PWC_FCG0_PERIPH_RAM0        RAM0 clock
 ** \arg    PWC_FCG0_PERIPH_ECCRAM      ECCRAM clock
 ** \arg    PWC_FCG0_PERIPH_RetRAM      RetRAM clock
 ** \arg    PWC_FCG0_PERIPH_DMA1        DMA1 clock
 ** \arg    PWC_FCG0_PERIPH_DMA2        DMA2 clock
 ** \arg    PWC_FCG0_PERIPH_FCM         FCM clock
 ** \arg    PWC_FCG0_PERIPH_PTDIS       PTDIS clock
 ** \arg    PWC_FCG0_PERIPH_AES         AES clock
 ** \arg    PWC_FCG0_PERIPH_HASH        HASH clock
 ** \arg    PWC_FCG0_PERIPH_TRNG        TRNG clock
 ** \arg    PWC_FCG0_PERIPH_CRC         CRC clock
 ** \arg    PWC_FCG0_PERIPH_DCU1        DCU1 clock
 ** \arg    PWC_FCG0_PERIPH_DCU2        DCU2 clock
 ** \arg    PWC_FCG0_PERIPH_DCU3        DCU3 clock
 ** \arg    PWC_FCG0_PERIPH_DCU4        DCU4 clock
 ** \arg    PWC_FCG0_PERIPH_KEY         KEY clock

 ** \param  [in] enNewState             The new state of the clock output.
 ** \arg    Enable                      Enable clock output.
 ** \arg    Disable                     Disable clock output.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Fcg0PeriphClockCmd(uint32_t u32Fcg0Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG0_PERIPH(u32Fcg0Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_FCG0_REG_WRITE();

    if (Enable == enNewState)
    {
        M4_MSTP->FCG0 &= ~u32Fcg0Periph;
    }
    else
    {
        M4_MSTP->FCG0 |= u32Fcg0Periph;
    }

    DISABLE_FCG0_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the FCG1 peripheral clock.
 **
 ** \note   After reset,the peripheral clock is disabled and the application
 **         software has to enable this clock before using it.
 **
 ** \param  [in] u32Fcg1Periph          The peripheral in FCG1.
 ** \arg    PWC_FCG1_PERIPH_CAN         CAN clock
 ** \arg    PWC_FCG1_PERIPH_QSPI        QSPI clock
 ** \arg    PWC_FCG1_PERIPH_I2C1        I2C1 clock
 ** \arg    PWC_FCG1_PERIPH_I2C2        I2C2 clock
 ** \arg    PWC_FCG1_PERIPH_I2C3        I2C3 clock
 ** \arg    PWC_FCG1_PERIPH_USBFS       USBFS clock
 ** \arg    PWC_FCG1_PERIPH_SDIOC1      SDIOC1 clock
 ** \arg    PWC_FCG1_PERIPH_SDIOC2      SDIOC2 clock
 ** \arg    PWC_FCG1_PERIPH_I2S1        I2S1 clock
 ** \arg    PWC_FCG1_PERIPH_I2S2        I2S2 clock
 ** \arg    PWC_FCG1_PERIPH_I2S3        I2S3 clock
 ** \arg    PWC_FCG1_PERIPH_I2S4        I2S4 clock
 ** \arg    PWC_FCG1_PERIPH_SPI1        SPI1 clock
 ** \arg    PWC_FCG1_PERIPH_SPI2        SPI2 clock
 ** \arg    PWC_FCG1_PERIPH_SPI3        SPI3 clock
 ** \arg    PWC_FCG1_PERIPH_SPI4        SPI4 clock
 ** \arg    PWC_FCG1_PERIPH_USART1      USART1 clock
 ** \arg    PWC_FCG1_PERIPH_USART2      USART2 clock
 ** \arg    PWC_FCG1_PERIPH_USART3      USART3 clock
 ** \arg    PWC_FCG1_PERIPH_USART4      USART4 clock
 **
 ** \param  [in] enNewState             The new state of the clock output.
 ** \arg    Enable                      Enable clock output.
 ** \arg    Disable                     Disable clock output.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Fcg1PeriphClockCmd(uint32_t u32Fcg1Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG1_PERIPH(u32Fcg1Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

