MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
    if (Enable == enNewState)
    {
        M4_MSTP->FCG1 &= ~u32Fcg1Periph;
    }
    else
    {
        M4_MSTP->FCG1 |= u32Fcg1Periph;
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the FCG2 peripheral clock.
 **
 ** \note   After reset,the peripheral clock is disabled and the application
 **         software has to enable this clock before using it.
 **
 ** \param  [in] u32Fcg2Periph          The peripheral in FCG2.
 ** \arg    PWC_FCG2_PERIPH_TIM01       TIM01 clock
 ** \arg    PWC_FCG2_PERIPH_TIM02       TIM02 clock
 ** \arg    PWC_FCG2_PERIPH_TIMA1       TIMA1 clock
 ** \arg    PWC_FCG2_PERIPH_TIMA2       TIMA2 clock
 ** \arg    PWC_FCG2_PERIPH_TIMA3       TIMA3 clock
 ** \arg    PWC_FCG2_PERIPH_TIMA4       TIMA4 clock
 ** \arg    PWC_FCG2_PERIPH_TIMA5       TIMA5 clock
 ** \arg    PWC_FCG2_PERIPH_TIMA6       TIMA6 clock
 ** \arg    PWC_FCG2_PERIPH_TIM41       TIM41 clock
 ** \arg    PWC_FCG2_PERIPH_TIM42       TIM42 clock
 ** \arg    PWC_FCG2_PERIPH_TIM43       TIM43 clock
 ** \arg    PWC_FCG2_PERIPH_EMB         EMB clock
 ** \arg    PWC_FCG2_PERIPH_TIM61       TIM61 clock
 ** \arg    PWC_FCG2_PERIPH_TIM62       TIM62 clock
 ** \arg    PWC_FCG2_PERIPH_TIM63       TIM63 clock

 **
 ** \param  [in] enNewState             The new state of the clock output.
 ** \arg    Enable                      Enable clock output.
 ** \arg    Disable                     Disable clock output.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Fcg2PeriphClockCmd(uint32_t u32Fcg2Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG2_PERIPH(u32Fcg2Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        M4_MSTP->FCG2 &= ~u32Fcg2Periph;
    }
    else
    {
        M4_MSTP->FCG2 |= u32Fcg2Periph;
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the FCG3 peripheral clock.
 **
 ** \note   After reset,the peripheral clock is disabled and the application
 **         software has to enable this clock before using it.
 **
 ** \param  [in] u32Fcg3Periph          The peripheral in FCG3.
 ** \arg    PWC_FCG3_PERIPH_ADC1        ADC1 clock
 ** \arg    PWC_FCG3_PERIPH_ADC2        ADC2 clock
 ** \arg    PWC_FCG3_PERIPH_DAC         DAC clock
 ** \arg    PWC_FCG3_PERIPH_CMP         CMP clock
 ** \arg    PWC_FCG3_PERIPH_OTS         OTS clock
 **
 ** \param  [in] enNewState             The new state of the clock output.
 ** \arg    Enable                      Enable clock output.
 ** \arg    Disable                     Disable clock output.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Fcg3PeriphClockCmd(uint32_t u32Fcg3Periph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PWC_FCG3_PERIPH(u32Fcg3Periph));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        M4_MSTP->FCG3 &= ~u32Fcg3Periph;
    }
    else
    {
        M4_MSTP->FCG3 |= u32Fcg3Periph;
    }
}

/**
 *******************************************************************************
 ** \brief  The stop mode configuration.
 **
 ** \param  [in] pstcStpMdCfg           Pointer to stop mode configuration structure.
 ** \arg    Enable                      Enable stop mode.
 ** \arg    Disable                     Disable stop mode.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t PWC_StopModeCfg(const stc_pwc_stop_mode_cfg_t *pstcStpMdCfg)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_PWC_STOP_MODE_FLASH(pstcStpMdCfg->enStopFlash));
    DDL_ASSERT(IS_PWC_STOP_MODE_CLK(pstcStpMdCfg->enStopClk));

    ENABLE_PWR_REG0_WRITE();

    M4_SYSREG->PWR_STPMCR = (pstcStpMdCfg->enStopFlash |
                             (pstcStpMdCfg->enStopClk << 1u));

    /* if should close HRC & PLL while stop mode, please disable before modifying the register */
    if (Disable == pstcStpMdCfg->enPll)
    {
        /* PLL is system clock */
        if (5u == M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            /* Disable PLL */
            M4_SYSREG->CMU_PLLCR_f.MPLLOFF = 1u;
        }
    }

    /* Hrc power should be enable. */
    M4_SYSREG->PWR_PWRC1_f.VHRCSD = 0u;
    M4_SYSREG->PWR_PWRC1_f.VPLLSD = ((Enable == pstcStpMdCfg->enPll) ? 0u : 1u);
    M4_SYSREG->PWR_PWRC1_f.STPDAS = pstcStpMdCfg->enStpDrvAbi;

    DISABLE_PWR_REG0_WRITE();

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the power down wake up event.
 **
 ** \param  [in] u32Wkup0Event          The wake_up event in PDWKEN0.
 ** \arg    PWC_STOPWKUPEN_EIRQ0        EIRQ0 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ1        EIRQ1 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ2        EIRQ2 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ3        EIRQ3 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ4        EIRQ4 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ5        EIRQ5 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ6        EIRQ6 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ7        EIRQ7 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ8        EIRQ8 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ9        EIRQ9 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ10       EIRQ10 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ11       EIRQ11 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ12       EIRQ12 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ13       EIRQ13 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ14       EIRQ14 wake_up event
 ** \arg    PWC_STOPWKUPEN_EIRQ15       EIRQ15 wake_up event
 ** \arg    PWC_STOPWKUPEN_SWDT         SWDT wake_up event
 ** \arg    PWC_STOPWKUPEN_VDU1         VDU1 wake_up event
 ** \arg    PWC_STOPWKUPEN_VDU2         VDU2 wake_up event
 ** \arg    PWC_STOPWKUPEN_CMPI0        CMPI0 wake_up event
 ** \arg    PWC_STOPWKUPEN_WKTM         WKTM wake_up event
 ** \arg    PWC_STOPWKUPEN_RTCAL        RTCAL wake_up event
 ** \arg    PWC_STOPWKUPEN_RTCPRD       RTCPRD wake_up event
 ** \arg    PWC_STOPWKUPEN_TMR0         TMR0 wake_up event
 ** \arg    PWC_STOPWKUPEN_USARTRXD     USARTRXD wake_up event
 **
 ** \param  [in] enNewState             The new state of the wake_up event.
 ** \arg    Enable                      Enable wake_up event.
 ** \arg    Disable                     Disable wake_up event.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_StopWkupCmd(uint32_t u32Wkup0Event, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

