MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
    if (Enable == enNewState)
    {
        M4_INTC->WUPEN |= u32Wkup0Event;
    }
    else
    {
        M4_INTC->WUPEN &= ~u32Wkup0Event;
    }
}

/**
 *******************************************************************************
 ** \brief  Enter sleep mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void PWC_EnterSleepMd(void)
{
    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_STPMCR_f.STOP = 0u;
    M4_SYSREG->PWR_PWRC0_f.PWDN = 0u;

    DISABLE_PWR_REG_WRITE();

    __WFI();
}
/**
 *******************************************************************************
 ** \brief  Ram configuration(include ram operate mode & ram power down control).
 **
 ** \param  [in] pstcRamCfg             The struct of ram configuration.
 ** \arg    enRam0                      Ram0(0x20000000-0x2000FFFF) power down control.
 ** \arg    enRam1                      Ram1(0x20010000-0x2001FFFF) power down control.
 ** \arg    enRam2                      Ram2(0x20020000-0x20026FFF) power down control.
 ** \arg    enRam3                      Rom3(0x1FFF8000-0x1FFFFFFF) power down control.
 ** \arg    enUsbfs                     Usbfs power down control.
 ** \arg    enSdioc0                    Sdioc0 power down control.
 ** \arg    enSdioc1                    Sdioc1 power down control.
 ** \arg    enCan                       Can power down control.
 ** \arg    enCache                     Cache power down control.
 ** \arg    enRamOpMd                   Ram operate mode.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_RamCfg(const stc_pwc_ram_cfg_t *pstcRamCfg)
{
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enRam0));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enRam1));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enRam2));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enRam3));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enUsbfs));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enSdioc0));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enSdioc1));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enCan));
    DDL_ASSERT(IS_PWC_RAM_PWR_CTL(pstcRamCfg->enCache));
    DDL_ASSERT(IS_PWC_RAM_OP_MD(pstcRamCfg->enRamOpMd));

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_RAMPC0 = (pstcRamCfg->enRam0 |
                             (pstcRamCfg->enRam1 << 1ul) |
                             (pstcRamCfg->enRam2 << 2ul) |
                             (pstcRamCfg->enRam3 << 3ul) |
                             (pstcRamCfg->enUsbfs << 4ul) |
                             (pstcRamCfg->enSdioc0 << 5ul) |
                             (pstcRamCfg->enSdioc1 << 6ul) |
                             (pstcRamCfg->enCan << 7ul) |
                             (pstcRamCfg->enCache << 8ul));

    M4_SYSREG->PWR_RAMOPM = pstcRamCfg->enRamOpMd;

    DISABLE_PWR_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable XTAL/RTC/WKTM bias current.
 **
 ** \param  [in] enNewState             The XTAL/RTC/WKTM bias current state.
 ** \arg    Enable                      Enable XTAL/RTC/WKTM bias current.
 ** \arg    Disable                     Disable XTAL/RTC/WKTM bias current.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Xtal32CsCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PWR_REG0_WRITE();

    M4_SYSREG->PWR_XTAL32CS_f.CSDIS = ((Enable == enNewState) ? 0u : 1u);

    DISABLE_PWR_REG0_WRITE();
}

/**
 *******************************************************************************
 ** \brief  wake_up timer control.
 **
 ** \param  [in] pstcWktmCtl            The wake_up timer configuration.
 ** \arg    enWktmEn                    Enable or disable wake_up timer.
 ** \arg    enWkclk                     The wake_up timer clock.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_WktmControl(const stc_pwc_wktm_ctl_t *pstcWktmCtl)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcWktmCtl->enWktmEn));
    DDL_ASSERT(IS_PWC_WKTM_CLK(pstcWktmCtl->enWkclk));
    DDL_ASSERT(IS_PWC_WKTMOVER_FLAG(pstcWktmCtl->enWkOverFlag));

    ENABLE_PWR_REG_WRITE();

    M4_WKTM->CR = ((pstcWktmCtl->u16WktmCmp & PWC_WKTMCMP_MSK) |
                   (pstcWktmCtl->enWkOverFlag << 12) |
                   (pstcWktmCtl->enWkclk << 13) |
                   (pstcWktmCtl->enWktmEn << 15));

    DISABLE_PWR_REG_WRITE();
}
/**
 *******************************************************************************
 ** \brief  The pvd configuration.
 **
 ** \param  [in] pstcPvdCfg             The pvd configuration.
 ** \arg    enPtwk0Edge                 Ptwk0 edge
 ** \arg    enPtwk1Edge                 Ptwk1 edge
 ** \arg    enPtwk2Edge                 Ptwk2 edge
 ** \arg    enPtwk3Edge                 Ptwk3 edge
 ** \arg    enPvd1Edge                  Pvd1 edge
 ** \arg    enPvd1Edge                  Pvd2 edge
 ** \arg    enNmiEdge                   Nmi edge
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_PvdCfg(const stc_pwc_pvd_cfg_t *pstcPvdCfg)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPvdCfg->stcPvd1Ctl.enPvdIREn));
    DDL_ASSERT(IS_PWC_PVD_MD(pstcPvdCfg->stcPvd1Ctl.enPvdMode));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPvdCfg->stcPvd1Ctl.enPvdCmpOutEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPvdCfg->stcPvd2Ctl.enPvdIREn));
    DDL_ASSERT(IS_PWC_PVD_MD(pstcPvdCfg->stcPvd2Ctl.enPvdMode));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPvdCfg->stcPvd2Ctl.enPvdCmpOutEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPvdCfg->enPvd1FilterEn));
    DDL_ASSERT(IS_PWC_PVD_FILTER_CLK(pstcPvdCfg->enPvd1Filtclk));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcPvdCfg->enPvd2FilterEn));
    DDL_ASSERT(IS_PWC_PVD_FILTER_CLK(pstcPvdCfg->enPvd2Filtclk));
    DDL_ASSERT(IS_PWC_PVD1_LEVEL(pstcPvdCfg->enPvd1Level));
    DDL_ASSERT(IS_PWC_PVD2_LEVEL(pstcPvdCfg->enPvd2Level));
    DDL_ASSERT(IS_PWC_PVD_INT_SEL(pstcPvdCfg->enPvd1Int));
    DDL_ASSERT(IS_PWC_PVD_INT_SEL(pstcPvdCfg->enPvd2Int));

    ENABLE_PVD_REG_WRITE();

    /* Config Pvd control. */
    M4_SYSREG->PWR_PVDCR1 = (pstcPvdCfg->stcPvd1Ctl.enPvdIREn |
                             (pstcPvdCfg->stcPvd1Ctl.enPvdMode << 1) |
                             (pstcPvdCfg->stcPvd1Ctl.enPvdCmpOutEn << 2) |
                             (pstcPvdCfg->stcPvd2Ctl.enPvdIREn << 4) |
                             (pstcPvdCfg->stcPvd2Ctl.enPvdMode << 5) |
                             (pstcPvdCfg->stcPvd2Ctl.enPvdCmpOutEn << 6));
    /* Set pvd filter sampling. */
    M4_SYSREG->PWR_PVDFCR = (~(pstcPvdCfg->enPvd1FilterEn) |
                             (pstcPvdCfg->enPvd1Filtclk << 1) |
                             ((~pstcPvdCfg->enPvd2FilterEn) << 4) |
                             (pstcPvdCfg->enPvd2Filtclk << 5));
    /* Set pvd level. */
    M4_SYSREG->PWR_PVDLCR = (pstcPvdCfg->enPvd1Level |
                             (pstcPvdCfg->enPvd2Level << 4));
    /* Set pvd interrupt(non_maskable or maskable). */
    M4_SYSREG->PWR_PVDICR = (pstcPvdCfg->enPvd1Int |
                             (pstcPvdCfg->enPvd2Int << 4));

    DISABLE_PVD_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable pvd1.
 **
 ** \param  [in] enNewState             The pvd1 state.
 ** \arg    Enable                      Enable pvd1.
 ** \arg    Disable                     Disable pvd1.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Pvd1Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PVD_REG_WRITE();

    M4_SYSREG->PWR_PVDCR0_f.PVD1EN = ((Enable == enNewState) ? 1u : 0u);

    DISABLE_PVD_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable pvd2.
 **
 ** \param  [in] enNewState             The pvd2 state.
 ** \arg    Enable                      Enable pvd2.
 ** \arg    Disable                     Disable pvd2.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_Pvd2Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PVD_REG_WRITE();

