MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
    M4_SYSREG->PWR_PVDCR0_f.PVD2EN = ((Enable == enNewState) ? 1u : 0u);

    DISABLE_PVD_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable external vcc.
 **
 ** \param  [in] enNewState             The external vcc state.
 ** \arg    Enable                      Enable external vcc.
 ** \arg    Disable                     Disable external vcc.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void PWC_ExVccCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PVD_REG_WRITE();

    M4_SYSREG->PWR_PVDCR0_f.EXVCCINEN = ((Enable == enNewState) ? 1u : 0u);

    DISABLE_PVD_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Get pvd detection flag.
 **
 ** \param  [in] enPvdFlag              The flag of pvd detection.
 ** \arg    Pvd1Flag                    The flag of pvd1 detection.
 ** \arg    Pvd2Flag                    The flag of pvd2 detection.
 **
 ** \retval en_flag_status_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t PWC_GetPvdFlag(en_pwc_pvd_flag_t enPvdFlag)
{
    uint8_t u8flag = 0u;

    switch (enPvdFlag)
    {
    case Pvd1Flag:
        u8flag = M4_SYSREG->PWR_PVDDSR_f.PVD1DETFLG;
        break;
    case Pvd2Flag:
        u8flag = M4_SYSREG->PWR_PVDDSR_f.PVD2DETFLG;
        break;
    default:
        break;
    }

    return ((1u == u8flag) ? Set : Reset);
}

/**
 *******************************************************************************
 ** \brief  Enable or disable HRC power.
 **
 ** \param  [in] enNewState             The HRC power state.
 ** \arg    Enable                      Enable HRC power.
 ** \arg    Disable                     Disable HRC power.
 **
 ** \retval None
 **
 ******************************************************************************/
void PWC_HrcPwrCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PVD_REG_WRITE();

    M4_SYSREG->PWR_PWRC1_f.VHRCSD = ((Enable == enNewState) ? 0u : 1u);

    DISABLE_PVD_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable PLL power.
 **
 ** \param  [in] enNewState             The PLL power state.
 ** \arg    Enable                      Enable PLL power.
 ** \arg    Disable                     Disable PLL power.
 **
 ** \retval None
 **
 ******************************************************************************/
void PWC_PllPwrCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_PVD_REG_WRITE();

    M4_SYSREG->PWR_PWRC1_f.VPLLSD = ((Enable == enNewState) ? 0u : 1u);

    DISABLE_PVD_REG_WRITE();
}
/**
 *******************************************************************************
 ** \brief NVIC backup and disable before entry from stop mode
 **
 ** param  none
 **
 ** retval Ok                           Ok, Backup and disable sucessfully.
 **
 *****************************************************************************/
static en_result_t PWC_enNvicBackup(void)
{
    uint8_t u8Cnt;
    stc_intc_sel_field_t *stcIntSel;
    uint32_t u32WakeupSrc = INT_MAX;
    en_result_t enRet = Ok;

    /* Backup NVIC set enable register for IRQ0~143*/
    for (u8Cnt = 0u; u8Cnt < sizeof(NVIC_ISER_BAK) / sizeof(uint32_t); u8Cnt++)
    {
        NVIC_ISER_BAK[u8Cnt] = NVIC->ISER[u8Cnt];
    }

    /* Disable share vector */
    for (u8Cnt = 128u; u8Cnt < 144u; u8Cnt++)
    {
        NVIC_DisableIRQ((IRQn_Type)u8Cnt);
    }

    for (u8Cnt = 0u; u8Cnt < 128u; u8Cnt++)
    {
        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(&M4_INTC->SEL0) + (4ul * u8Cnt));
        /* Disable NVIC if it is the wakeup-able source from stop mode */
        u32WakeupSrc = stcIntSel->INTSEL;
        if (IS_VALID_WKUP_SRC(u32WakeupSrc))
        {
            switch (stcIntSel->INTSEL)
            {
            case INT_USART1_WUPI:
                if (Reset == bM4_INTC_WUPEN_SCIWEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_TMR01_GCMA:
                if (Reset == bM4_INTC_WUPEN_TMR0WUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_RTC_ALM:
                if (Reset == bM4_INTC_WUPEN_RTCALMWUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_RTC_PRD:
                if (Reset == bM4_INTC_WUPEN_RTCPRDWUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_WKTM_PRD:
                if (Reset == bM4_INTC_WUPEN_WKTMWUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_ACMP1:
                if (Reset == bM4_INTC_WUPEN_CMPI0WUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PVD_PVD1:
                if (Reset == bM4_INTC_WUPEN_PVD1WUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PVD_PVD2:
                if (Reset == bM4_INTC_WUPEN_PVD2WUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_SWDT_REFUDF:
                if (Reset == bM4_INTC_WUPEN_SWDTWUEN)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ0:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN0)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ1:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN1)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ2:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN2)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ3:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN3)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ4:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN4)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ5:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN5)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ6:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN6)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ7:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN7)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ8:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN8)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ9:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN9)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ10:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN10)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ11:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN11)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ12:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN12)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ13:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN13)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ14:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN14)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            case INT_PORT_EIRQ15:
                if (Reset == bM4_INTC_WUPEN_EIRQWUEN15)
                {
                    NVIC_DisableIRQ((IRQn_Type)u8Cnt);
                }
                break;
            default:
                break;
            }
        }
        /* Disable NVIC for all none-wakeup source */
        else if (INT_MAX != stcIntSel->INTSEL)
        {
            NVIC_DisableIRQ((IRQn_Type)u8Cnt);
        }
        else
        {
            enRet = ErrorInvalidParameter;
            break;
        }
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief NVIC recover after wakeup from stop mode
 **
 ** param  none
 **
 ** retval Ok                           Ok, NVIC set enable recover sucessfully.
 **
 *****************************************************************************/
static en_result_t PWC_enNvicRecover(void)
{
    uint8_t u8Cnt;

    for (u8Cnt = 0u; u8Cnt < sizeof(NVIC_ISER_BAK) / sizeof(uint32_t); u8Cnt++)
    {
        NVIC->ISER[u8Cnt] = NVIC_ISER_BAK[u8Cnt];
    }
    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Select system clock source.
 **
 ** \param  [in] u8SysSrc         The system clock source.
 **
 ** \retval None
 **
 ** \note   Must close all of the fcg register before switch system clock source.
 **         This function only be called in func. PWC_enClockBackup and
 **         PWC_enClockRecover.
 **         If need to switch system clock please call CLK_SetSysClkSource.
 **
 ******************************************************************************/
static void PWC_SetSysClk(uint8_t u8SysSrc)
{
    __IO uint32_t fcg0 = M4_MSTP->FCG0;
    __IO uint32_t fcg1 = M4_MSTP->FCG1;
    __IO uint32_t fcg2 = M4_MSTP->FCG2;
    __IO uint32_t fcg3 = M4_MSTP->FCG3;

    /* Only current system clock source or target system clock source is MPLL
    need to close fcg0~fcg3 and open fcg0~fcg3 during switch system clock source.
    We need to backup fcg0~fcg3 before close them. */
    if ((5u == M4_SYSREG->CMU_CKSWR_f.CKSW) || (5u == u8SysSrc))
    {
        /* Close fcg0~fcg3. */
        M4_MSTP->FCG0 = 0xFFFFFAEEul;
        M4_MSTP->FCG1 = 0xFFFFFFFFul;
        M4_MSTP->FCG2 = 0xFFFFFFFFul;
        M4_MSTP->FCG3 = 0xFFFFFFFFul;

        Ddl_Delay1us(1ul);
    }

    /* Switch to target system clock source. */
    ENABLE_PWR_REG0_WRITE();

