MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_pwc.c
    M4_SYSREG->CMU_CKSWR_f.CKSW = u8SysSrc;

    DISABLE_PWR_REG0_WRITE();

    /* update system clock frequency. */
    SystemCoreClockUpdate();

    Ddl_Delay1us(1ul);

    /* Open fcg0~fcg3. */
    M4_MSTP->FCG0 = fcg0;
    M4_MSTP->FCG1 = fcg1;
    M4_MSTP->FCG2 = fcg2;
    M4_MSTP->FCG3 = fcg3;

    Ddl_Delay1us(1ul);
}
/**
 *******************************************************************************
 ** \brief  Backup HRC/MRC state and system clock , enable HRC/MRC ,set MRC as
 **         system clock before enter stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
static void PWC_enClockBackup(void)
{
    __IO uint32_t timeout = 0ul;
    en_flag_status_t status = Reset;

    /* HRC state backup. */
    u8HrcState = (uint8_t)bM4_SYSREG_CMU_HRCCR_HRCSTP;
    /* System clock backup*/
    u8SysClkSrc = M4_SYSREG->CMU_CKSWR_f.CKSW;

    ENABLE_PWR_REG0_WRITE();

    /* Enable HRC  before enter stop mode. */
    if (0u != u8HrcState)
    {
        bM4_SYSREG_CMU_HRCCR_HRCSTP = 0u;
        do
        {
            status = (en_flag_status_t)M4_SYSREG->CMU_OSCSTBSR_f.HRCSTBF;
            timeout++;
        } while ((timeout < 0x1000ul) && (status != Set));
    }
    else
    {
        /* code */
    }
    /* When system clock source is HRC and MPLL, set MRC as system clock. . */
    if ((0u == u8SysClkSrc) || (5u == u8SysClkSrc))
    {
        /* MRC state backup. */
        u8MrcState = (uint8_t)bM4_SYSREG_CMU_MRCCR_MRCSTP;
        if (0u != u8MrcState)
        {
            bM4_SYSREG_CMU_MRCCR_MRCSTP = 0u;
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
        PWC_SetSysClk(1u);
    }
    else
    {
        /* code */
    }

    DISABLE_PWR_REG0_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Recover HRC/MRC state and system clock after wakeup stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
static void PWC_enClockRecover(void)
{
    ENABLE_PWR_REG0_WRITE();

    if ((0u == u8SysClkSrc) || (5u == u8SysClkSrc))
    {
        /* Recover MRC state & system clock source. */
        M4_SYSREG->CMU_MRCCR_f.MRCSTP = u8MrcState;
        PWC_SetSysClk(u8SysClkSrc);
    }
    /* Recover HRC state after wakeup stop mode. */
    M4_SYSREG->CMU_HRCCR_f.HRCSTP = u8HrcState;

    DISABLE_PWR_REG0_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Clock backup before enter stop mode and mark it.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called before func. PWC_EnterStopMd.
 ******************************************************************************/
static void PWC_ClkBackup(void)
{
    /* Disable all interrupt to ensure the following operation continued. */
    __disable_irq();

    /* HRC/MRC backup and switch system clock as MRC before entry from stop mode. */
    PWC_enClockBackup();

    /* Mark the system clock has been switch as MRC, and will enter the stop mode. */
    u8StopFlag = 1u;

    /* Enable all interrupt. */
    __enable_irq();
}

/**
 *******************************************************************************
 ** \brief  Clock recover after wakeup stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called after func. PWC_EnterStopMd.
 ******************************************************************************/
static void PWC_ClkRecover(void)
{
    /* Disable all interrupt to ensure the following operation continued. */
    __disable_irq();

    /* Mark the system clock will be switch as MRC, and has waked_up from stop mode. */
    u8StopFlag = 0u;

    /* Recover HRC/MRC state and system clock after wakeup stop mode. */
    PWC_enClockRecover();

    /* Enable all interrupt. */
    __enable_irq();
}

/**
 *******************************************************************************
 ** \brief  Clock backup before exit wakup interrupt.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called before exit wakup interrput.
 ******************************************************************************/
void PWC_IrqClkBackup(void)
{
    if ((1ul == u8StopFlag) && (1ul == u8WkupIntCnt))
    {
        /* HRC/MRC backup and switch system clock as MRC. */
        PWC_enClockBackup();
    }
    u8WkupIntCnt--;
}

/**
 *******************************************************************************
 ** \brief  Clock recover after enter wakeup interrupt.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called after enter wakup interrput.
 ******************************************************************************/
void PWC_IrqClkRecover(void)
{
    /* The varibale to display how many waked_up interrupt has been occured
       simultaneously and to decided whether backup clock before exit wake_up
       interrupt. */
    u8WkupIntCnt++;

    if (1ul == u8StopFlag)
    {
        /* Recover HRC/MRC state and system clock. */
        PWC_enClockRecover();
    }
}

/**
 *******************************************************************************
 ** \brief  Enter stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void PWC_EnterStopMd(void)
{
    /* NVIC backup and disable before entry from stop mode.*/
    PWC_enNvicBackup();
    /* Clock backup and switch system clock as MRC before entry from stop mode. */
    PWC_ClkBackup();

    ENABLE_PWR_REG_WRITE();

    M4_SYSREG->PWR_STPMCR_f.STOP = 1u;
    M4_SYSREG->PWR_PWRC0_f.PWDN = 0u;

    DISABLE_PWR_REG_WRITE();

    __WFI();

    /* Recover HRC/MRC state and system clock after wakeup from stop mode. */
    PWC_ClkRecover();
    /* NVIC recover after wakeup from stop mode. */
    PWC_enNvicRecover();
}

#endif /* DDL_PWC_ENABLE */

void set_vcap(void)
{
    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_PWRC3_f.PDTS = 0;
    DISABLE_PWR_REG_WRITE();
}

//@} // PwcGroup

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
